      % Формиране на грешката в показателя за оптимизиране
function f=cls_er_1 (pid);
      % Оптимизируемите параметри се дефинират като глобални.
global k ti td T S
      % pid - вектор с оптимизируемите параметри k, ti и td,
      % f     - сигнал на грешката в целия интервал на наблюдение T
      %  при такт на измерване S.         
k=pid(1); ti=pid(2); td=pid(3);
      % Симулиране на затворената система с име s_cls_1 чрез 
      % функцията sim в интервала от 0 до T сек. 
[t,x,y]=sim ('s_cls_1', T);
      % Линейно интерполиране на траекторията на регулируемата
      % величина през интервал от S (конкретно число) сек. чрез
      % равномерно разположени N (N=1+T/S) точки, което създава
      % удобство при графично оформяне на резултатa от 
      % функциониране на оптималната система за управление 
e=interp1 (t, y(:,1), 0:S:T);
      % Формиране на грешката.
f=e*(e');
      % Край на функцията.
end