function [Ko,T,L,Tmax]=h2KTL(he)
% Предназначение
% Апроксимиране на преходна
% характеристика в три-параметричен
% модел W(p)=Ko/(1+Tp)*e^(-Lp) 
% чрез  метод на допирателната
% Входни аргументи: 
% he –преходна функция (вектор).
% Изходни аргументи: 
% Ko – коефициент на усилване (скалар);
% T – времеконстанта (скалар);
% L – чисто закъснение (скалар).
% Tmax – максимална времеконстанта
% (скалар);
% Спомагателни авторски функции :
% infl_ind
% Определяне на явното чисто закъснение
[n,m]=size(he);
for i=1:n-1
   if(he(i+1,2)>he(i,2))
      Lapparent=i;
      break
   end
end
% Определяне на инфлексната точка
for i=Lapparent:n-2
  ind=infl_ind(he(i,:),he(i+1,:),he(i+2,:));
  if (ind==2) | (ind==3)
     ipn=i;
     break;
  end
end
% Изчислява коефициентите на допирателните y=coefi(1)*x+coefi(2)
x1=[he(ipn-1,1) he(ipn,1) he(ipn+1,1)]; y1=[he(ipn-1,2) he(ipn,2) he(ipn+1,2)];
coef1=polyfit(x1,y1,1);
x2=[he(ipn,1) he(ipn+1,1) he(ipn+2,1)];y2=[he(ipn,2) he(ipn+1,2) he(ipn+2,2)];
coef2=polyfit(x2,y2,1);	
% Осредняване на двете допирателни
coef=(coef1+coef2)/2;
% Координати на пресечната точка с абцисата
coor1(1)=-coef(2)/coef(1); coor1(2)=0;
% Координати на пресечната точка с установената стойност
coor2(1)=(he(n,2)-coef(2))/coef(1); coor2(2)=he(n,2);
% Изчертава преходната характеристика
plot(he(:,1),he(:,2),'b-'), hold on, grid
% Отбелязва координатите на инфлексната точка
x_infl=(he(ipn,1)+he(ipn+1,1))/2; y_infl=(he(ipn,2)+he(ipn+1,2))/2;
plot(x_infl,y_infl,'*'); 
% Изчертава допирателната
line([coor1(1) coor2(1)],[coor1(2) coor2(2)]);	
% Изчертава установената стойност
line([0 he(n,1)],[he(n,2) he(n,2)]);	
% Изчертава абцисната ос
line([0 he(n,1)],[0 0]);	
% Отбелязва координатите на пресечните точки на допирателната
plot(coor2(1),coor2(2),'o'); % (с установената стойност)
plot(coor1(1),coor1(2),'o'); % (с абцисата)
hold off
% Определяне на параметрите на модела
% Коефициент на усилване
Ko=coor2(2);
% Времеконстанта
T=interp1(he(Lapparent+1:n,2), he(Lapparent+1:n,1),0.63*Ko)-coor1(1);

% Чисто закъснение
L=coor1(1);
% Максимална времеконстанта
Tmax=coor2(1)-coor1(1);

