function [Ko,T,L]=h2Strejc(he,p)
% Предназначение
% Апроксимиране на преходна 
% характеристика в три-параметричен
% модел W(p)=Ko/(1+Tp)*e^(-Lp) чрез графоаналитичен метод на Strejc
% Входни аргументи: 
% he – преходна функция (вектор);
% p – стойност в интервала (0.85 – 0.9) 
% (скалар). 
% Изходни аргументи: 
% Ko – коефициент на усилване (скалар);
% T – времеконстанта (скалар);
% L – чисто закъснение (скалар).
% Спомагателни авторски функции :
% infl_ind
% Определяне на явното чисто закъснение
[n,m]=size(he);
for i=1:n-1
   if(he(i+1,2)>he(i,2))
      Lapparent=i;
      break
   end
end
% Определяне на инфлексната точка
for i=Lapparent:n-2
  ind=infl_ind(he(i,:),he(i+1,:),he(i+2,:));	
if (ind==2) | (ind==3)
     ipn=i;
     break;
  end
end 
% Изчертава преходната характеристика
plot(he(:,1),he(:,2),'b-'), hold on, grid
% Отбелязва координатите на инфлексната точка A
ta=(he(ipn,1)+he(ipn+1,1))/2; ha=(he(ipn,2)+he(ipn+1,2))/2;
plot(ta,ha,'*'); 
% Определяне на параметрите на модела
% Коефициент на усилване
Ko=he(n,2);
% Отбелязва координатите на точка B
hb=p*Ko; tb=interp1(he(Lapparent+1:n,2), he(Lapparent+1:n,1),hb);
plot(tb,hb,'*'); 
hold off
% Междинни величини
lb=log(1-hb); la=log(1-ha);
% Чисто закъснение
L=(ta*lb-tb*la)/(lb-la);
% Времеконстанта
T=(L-tb)/lb;
