function ind=infl_ind(xy1,xy2,xy3)
% Извежда индекс за разположението
% на три последователни точки
%
% ind=0-->когато точките имат нулеви
%               координати;
% ind=1-->когато втората точка е под
%            правата между първа и трета;
% ind=2-->когато втората точка е върху
%            правата между първа и трета;
% ind=3-->когато втората точка е над
%            правата между първа и трета;
tgn1=(xy1(2)-xy2(2))/(xy1(1)-xy2(1));
tgn2=(xy1(2)-xy3(2))/(xy1(1)-xy3(1));

if tgn1==0 | tgn2==0
  ind=0;
elseif tgn1<tgn2
  ind=1;
elseif tgn1==tgn2 & (tgn1~=0|tgn2~=0)
  ind=2;
elseif tgn1>tgn2
  ind=3;
end
