function [K,Ti,Td]=PIDtun_ZN2(Ku,Tu,str)
% Предназначение
% Настройване на П, ПИ и ПИД регулатори
% по методa на Ziegler- Nichols
% чрез критичните параметри на 
% автоколебанията в САУ.
% Входни аргументи: 
% Ku – коеф. на автоколебания (скалар);
% Tu – период на автоколебания (скалар);
% str – символна променлива за типа на
%  регулатора (скалар),
%  str = ‘П’ – настройване на П регулатор;
%  str = ‘ПИ’ – настройване на ПИ регулатор;
%  str = ‘ПИД’ – настройване на ПИД регул.;
% Изходни аргументи: 
% K – коеф. на усилване на регул.(скалар);
% Ti – интегр. времеконстанта (скалар);
% Td – дифер. времеконстанта (скалар).if nargin<3
  % error('Don''t miss the third input argument!'), return,
 
if strcmp(str,'P')        K=0.5*Ku;
   elseif strcmp(str,'PI')  K=0.4*Ku; Ti=0.8*Tu;
   elseif strcmp(str,'PID') K=0.6*Ku; Ti=0.5*Tu; Td=0.125*Tu;
   else error('Wrong name of the controller!')
end
